{
  "user_data": {
    "allergies": [],
    "diet_type": "non-vegetarian",
    "medical_conditions": [
      "diabetes",
      "anemia"
    ],
    "trimester": 2
  },
  "food_items": [
    {
      "Food Item": "Dal Makhani",
      "Calories": "160 kcal per 100g",
      "Macronutrients": "29g Carbs, 14g Protein, 4g Fat, 6g Fiber",
      "Key Vitamins & Minerals": {
        "Iron": "5 mg",
        "Calcium": "50 mg",
        "Folate": "200 mcg"
      },
      "Pregnancy Benefits": "Rich in plant-based protein and fiber, which supports healthy digestion and blood sugar control. High in iron, essential for combating anemia and supporting the growing fetus. Good source of folate, crucial for preventing neural tube defects in the baby.",
      "Risks (if any)": "Moderation is key due to its calorie content. Avoid if there are any underlying digestive issues or intolerances to lentils.",
      "Best Ways to Eat": "Serve with a side of steamed vegetables or whole grain roti for a balanced meal. Pair with foods high in vitamin C (e.g., tomatoes or spinach) to enhance iron absorption."
    },
    {
      "Food Item": "Plain Rice",
      "Calories": "130 kcal per 100g",
      "Macronutrients": "28g Carbs, 2g Protein, 0.5g Fat, 0.5g Fiber",
      "Key Vitamins & Minerals": {
        "Iron": "1.4 mg",
        "Calcium": "20 mg",
        "Folate": "10 mcg"
      },
      "Pregnancy Benefits": "Provides easily digestible carbohydrates, essential for energy. Fortified varieties can help meet iron needs, supporting blood health. Supports overall nutrition during the second trimester when energy demands increase.",
      "Risks (if any)": "High glycemic index can affect blood sugar levels. Consume in moderation, especially with diabetes. Avoid over-reliance on refined or polished rice, as it lacks fiber and nutrients.",
      "Best Ways to Eat": "Pair with dal, vegetables, or lean protein sources to balance the meal. Opt for unpolished or brown rice for more fiber and nutrients."
    }
  ]
}